# Pandas tutorial quiz no answers

sergazy.nurbavliyev@gmail.com and admrggs@gmail.com @2021

<B>Note</B>: This quiz is about <B>Pandas</B>, so please only use Pandas!

This quiz includes the answers in encrypted form. The results are encrypted using "md5". I could have easily used "sha256" or "sha512" (both of which have the same API), but I preferred md5 to keep results short.

You will see the following "check" function called throughout the Quiz. Please do not touch those lines. They include the answers and will provide feedback to your results.

In [104]:
# imports
import numpy as np
import pandas as pd

from hashlib import md5 #, sha512, sha256, 

# Constants
STOP_AT_ERRORS = True  # Change this to "False" to avoid stopping execution on errors

In [105]:
answers = ["NO ANSWER"]*20

In [106]:
# Do not change anything in this cell!
def check(question_number, result, md5_digest_of_expected_result):
    result_str = ""
    if type(result) is list:
        for r in result:
            result_str += str(r)+"\n"
    else:
        result_str = str(result)+"\n"

    if question_number > 0:
        answers[question_number-1] = result_str

    md5_digest_of_result =  md5(result_str.encode()).hexdigest()
    if md5_digest_of_result != md5_digest_of_expected_result:
        print("ERROR: The result is NOT correct!")
        assert(not STOP_AT_ERRORS)
    else:
        print("The result is CORRECT!")

Let's read the input files into Pandas dataframes:

In [107]:
departments_filename = "Departments.csv"
employees_filename = "Employees.csv"

In [111]:
departments_df  = pd.read_csv(departments_filename)
departments_df

   Department ID       Department
0              1   EXECUTIVE TEAM
1              2      ENGINEERING
2              3  HUMAN RESOURCES
3              4            SALES
4              5            ADMIN
5              6          FINANCE
6              7        MARKETING
7              8               IT

In [70]:
employees_df  = pd.read_csv(employees_filename)
employees_df

,Employee ID,Name,Last Name,Title,Manager ID,Department ID,Hiring Date,Salary
0,1,ALBERT,ADAMS,CEO,0,1,2000-01-05,1000000
1,2,BILL,BABBLE,CTO,1,1,2000-01-05,500000
2,3,CAROL,CRAFT,CFO,1,1,2000-01-05,500000
3,4,DIANA,DEW,CIO,1,1,2000-01-05,500000
4,5,EDWARD,EVES,VP,1,2,2001-02-13,300000
5,6,FRANK,FABIOS,VP,1,3,2001-02-23,300000
6,7,GARY,GARFIELD,DIRECTOR,5,2,2001-04-16,200000
7,8,HENRY,HOOVER,MANAGER,7,2,2001-05-28,150000
8,9,IRENE,ISLES,ENGINEER,8,2,2001-08-18,120000
9,10,JEREMY,JACKSON,ENGINEER,8,2,2001-07-19,80000
10,11,KIM,KRATER,ENGINEER,8,2,2001-06-03,90000
11,12,LAURA,LEE,VP,1,4,2001-10-14,200000
12,13,MAY,MOORE,ASSISTANT,1,5,2003-02-06,40000
13,14,NANCY,NEWARK,DIRECTOR,1,6,2001-09-30,120000
14,15,OSCAR,OSWALD,MANAGER,14,6,2002-03-22,80000
15,16,PENNY,PEABODY,ACCOUNTANT,15,6,2002-05-06,60000
16,17,QUINCY,QUINN,DIRECTOR,18,3,2002-01-22,120000
17,18,RYAN,REDFORD,RECRUITER,17,3,2002-06-13,60000
18,19,SALLY,SMITH,MANAGER,17,3,2002-07-14,80000
19,20,TOM,TIMBER,ENGINEER,21,2,2003-01-25,120000
20,21,UMA,ULLMAN,VP,1,7,2002-11-07,180000
21,22,VICKY,VINCENT,PM,21,7,2003-05-07,120000
22,23,WENDY,WILLIAMS,ENGINEER,8,2,2003-09-21,140000
23,24,XIN,XIANG,MANAGER,1,8,2001-01-03,80000
24,25,YANNY,YOUNG,IT SUPPORT,24,8,2001-08-13,50000
25,26,ZACK,ZIMMERMAN,IT SUPPORT,24,8,2002-02-09,43000

Let's substitute the Department Names for "Department ID"s (and sort by "Employee ID"s as the original data was in that format and reset the index), so that we can work with a single data frame going forward:

In [112]:
employees = pd.merge(employees_df, departments_df, on="Department ID").sort_values("Employee ID").reset_index(drop=True)
employees

,Employee ID,Name,Last Name,Title,Manager ID,Department ID,Hiring Date,Salary,Department
0,1,ALBERT,ADAMS,CEO,0,1,2000-01-05,1000000,EXECUTIVE TEAM
1,2,BILL,BABBLE,CTO,1,1,2000-01-05,500000,EXECUTIVE TEAM
2,3,CAROL,CRAFT,CFO,1,1,2000-01-05,500000,EXECUTIVE TEAM
3,4,DIANA,DEW,CIO,1,1,2000-01-05,500000,EXECUTIVE TEAM
4,5,EDWARD,EVES,VP,1,2,2001-02-13,300000,ENGINEERING
5,6,FRANK,FABIOS,VP,1,3,2001-02-23,300000,HUMAN RESOURCES
6,7,GARY,GARFIELD,DIRECTOR,5,2,2001-04-16,200000,ENGINEERING
7,8,HENRY,HOOVER,MANAGER,7,2,2001-05-28,150000,ENGINEERING
8,9,IRENE,ISLES,ENGINEER,8,2,2001-08-18,120000,ENGINEERING
9,10,JEREMY,JACKSON,ENGINEER,8,2,2001-07-19,80000,ENGINEERING
10,11,KIM,KRATER,ENGINEER,8,2,2001-06-03,90000,ENGINEERING
11,12,LAURA,LEE,VP,1,4,2001-10-14,200000,SALES
12,13,MAY,MOORE,ASSISTANT,1,5,2003-02-06,40000,ADMIN
13,14,NANCY,NEWARK,DIRECTOR,1,6,2001-09-30,120000,FINANCE
14,15,OSCAR,OSWALD,MANAGER,14,6,2002-03-22,80000,FINANCE
15,16,PENNY,PEABODY,ACCOUNTANT,15,6,2002-05-06,60000,FINANCE
16,17,QUINCY,QUINN,DIRECTOR,18,3,2002-01-22,120000,HUMAN RESOURCES
17,18,RYAN,REDFORD,RECRUITER,17,3,2002-06-13,60000,HUMAN RESOURCES
18,19,SALLY,SMITH,MANAGER,17,3,2002-07-14,80000,HUMAN RESOURCES
19,20,TOM,TIMBER,ENGINEER,21,2,2003-01-25,120000,ENGINEERING
20,21,UMA,ULLMAN,VP,1,7,2002-11-07,180000,MARKETING
21,22,VICKY,VINCENT,PM,21,7,2003-05-07,120000,MARKETING
22,23,WENDY,WILLIAMS,ENGINEER,8,2,2003-09-21,140000,ENGINEERING
23,24,XIN,XIANG,MANAGER,1,8,2001-01-03,80000,IT
24,25,YANNY,YOUNG,IT SUPPORT,24,8,2001-08-13,50000,IT
25,26,ZACK,ZIMMERMAN,IT SUPPORT,24,8,2002-02-09,43000,IT

Let's set the order of the columns, so that our results come out as expected:

In [113]:
employees = employees[ ["Employee ID", "Name", "Last Name", "Title", "Manager ID",
                        "Hiring Date", "Salary", "Department", "Department ID"] ]

And finally let's change the dates (that are currently strings) into datetime so that we can treat them as time:

In [114]:
import datetime as dt
employees["Hiring Date"] = pd.to_datetime(employees["Hiring Date"])

Here is our final data frame:

In [115]:
employees

,Employee ID,Name,Last Name,Title,Manager ID,Hiring Date,Salary,Department,Department ID
0,1,ALBERT,ADAMS,CEO,0,2000-01-05,1000000,EXECUTIVE TEAM,1
1,2,BILL,BABBLE,CTO,1,2000-01-05,500000,EXECUTIVE TEAM,1
2,3,CAROL,CRAFT,CFO,1,2000-01-05,500000,EXECUTIVE TEAM,1
3,4,DIANA,DEW,CIO,1,2000-01-05,500000,EXECUTIVE TEAM,1
4,5,EDWARD,EVES,VP,1,2001-02-13,300000,ENGINEERING,2
5,6,FRANK,FABIOS,VP,1,2001-02-23,300000,HUMAN RESOURCES,3
6,7,GARY,GARFIELD,DIRECTOR,5,2001-04-16,200000,ENGINEERING,2
7,8,HENRY,HOOVER,MANAGER,7,2001-05-28,150000,ENGINEERING,2
8,9,IRENE,ISLES,ENGINEER,8,2001-08-18,120000,ENGINEERING,2
9,10,JEREMY,JACKSON,ENGINEER,8,2001-07-19,80000,ENGINEERING,2
10,11,KIM,KRATER,ENGINEER,8,2001-06-03,90000,ENGINEERING,2
11,12,LAURA,LEE,VP,1,2001-10-14,200000,SALES,4
12,13,MAY,MOORE,ASSISTANT,1,2003-02-06,40000,ADMIN,5
13,14,NANCY,NEWARK,DIRECTOR,1,2001-09-30,120000,FINANCE,6
14,15,OSCAR,OSWALD,MANAGER,14,2002-03-22,80000,FINANCE,6
15,16,PENNY,PEABODY,ACCOUNTANT,15,2002-05-06,60000,FINANCE,6
16,17,QUINCY,QUINN,DIRECTOR,18,2002-01-22,120000,HUMAN RESOURCES,3
17,18,RYAN,REDFORD,RECRUITER,17,2002-06-13,60000,HUMAN RESOURCES,3
18,19,SALLY,SMITH,MANAGER,17,2002-07-14,80000,HUMAN RESOURCES,3
19,20,TOM,TIMBER,ENGINEER,21,2003-01-25,120000,ENGINEERING,2
20,21,UMA,ULLMAN,VP,1,2002-11-07,180000,MARKETING,7
21,22,VICKY,VINCENT,PM,21,2003-05-07,120000,MARKETING,7
22,23,WENDY,WILLIAMS,ENGINEER,8,2003-09-21,140000,ENGINEERING,2
23,24,XIN,XIANG,MANAGER,1,2001-01-03,80000,IT,8
24,25,YANNY,YOUNG,IT SUPPORT,24,2001-08-13,50000,IT,8
25,26,ZACK,ZIMMERMAN,IT SUPPORT,24,2002-02-09,43000,IT,8

Good, now we can start to answer questions based on this data. 

We will first do some examples where I will provide the answers:

<B>EXAMPLE QUESTION</B>: What is the result returned when the "Salary" column is selected?

<B>SOLUTION</B>: Here is the result:

In [116]:
salaries = employees["Salary"]
salaries

0     1000000
1      500000
2      500000
3      500000
4      300000
5      300000
6      200000
7      150000
8      120000
9       80000
10      90000
11     200000
12      40000
13     120000
14      80000
15      60000
16     120000
17      60000
18      80000
19     120000
20     180000
21     120000
22     140000
23      80000
24      50000
25      43000
Name: Salary, dtype: int64

Here is the check we will use:

In [117]:
# Do not change the following line!
check(0, salaries, "8bcc6a94479f3c4ca345232afd7c45f3")

The result is CORRECT!

<B>EXAMPLE QUESTION</B>: What is the type of the result returned when the "Salary" column is selected?

<B>SOLUTION</B>: Selecting a column from a dataframe creates a "Series" in Pandas:

In [118]:
type_salaries = type(salaries)
type_salaries

pandas.core.series.Series

Here is the check for this:

In [119]:
# Do not change the following line!
check(0, type_salaries, "0e1efebbff5a4432e8905487e246e7b1")

The result is CORRECT!

Now answer the following questions, by filling out the following lines in a similar manner. Some lines may contain some variables that you have to use (you may use them as hints, too).

<B>QUESTION #1</B>: Find the average salary for the whole company rounded to the nearest integer

<B>SOLUTION</B>:

In [79]:
average_salary = round(employees['Salary'].mean()) # complete this line
average_salary

201269

In [80]:
# Do not change the following line!
check(1, average_salary, "f372243c0b3bf80ed243466d6e9aca53")

The result is CORRECT!

<B>QUESTION #2</B>: Find the difference between the maximum and minimum salary in the whole company

<B>SOLUTION</B>:

In [81]:
diff = salaries.max() - salaries.min() # complete this line
diff

960000

In [82]:
# Do not change the following line!
check(2, diff, "0ade79cc59eb1bf988adebab67178551")

The result is CORRECT!

<B>QUESTION #3</B>: Find the number of employees with the median salary of the company

<B>SOLUTION</B>:

In [83]:
median_salary = employees['Salary'].median()

median_employees = employees[employees['Salary'] == median_salary]
count = median_employees['Employee ID'].count() 
count

5

In [84]:
# Do not change the following line!
check(3, count, "1dcca23355272056f04fe8bf20edfce0")

The result is CORRECT!

<B>QUESTION #4</B>: Find full record of the 2nd most recently hired employee

<B>SOLUTION</B>:

In [85]:
sorted_employees = employees.sort_values(by='Hiring Date', ascending=False)

second_most_recent_hire = sorted_employees.iloc[[1]]
second_most_recent_hire

,Employee ID,Name,Last Name,Title,Manager ID,Hiring Date,Salary,Department,Department ID
21,22,VICKY,VINCENT,PM,21,2003-05-07,120000,MARKETING,7

In [86]:
# Do not change the following line!
check(4, second_most_recent_hire, "19f2fa773bf1df7ffc01714b2813469b")

The result is CORRECT!

<B>QUESTION #5</B>: Find the full name of the last employee hired to the company.
                    Your answer should be a single string with the "Name" and 
                    "Last Name" of the employee in it.

<B>SOLUTION</B>:

In [87]:
sorted_employees = employees.sort_values(by='Hiring Date', ascending=False)

last_employee = sorted_employees.iloc[0]
name_and_lastname_of_last_hire = last_employee['Name'] + ' ' + last_employee['Last Name']

name_and_lastname_of_last_hire

'WENDY WILLIAMS'

In [32]:
# Do not change the following line!
check(5, name_and_lastname_of_last_hire, "ad69fe413d34ccb23728fe6897632d7e")

The result is CORRECT!

<B>QUESTION #6</B>: Find the 2nd lowest salary in the company. The answer should only be a number.

<B>SOLUTION</B>:

In [33]:
sorted_employees = employees.sort_values(by='Salary', ascending=True)

second_lowest_salary = sorted_employees.iloc[1]['Salary']
second_lowest_salary

43000

In [34]:
# Do not change the following line!
check(6, second_lowest_salary, "e31a53d545e8572c12ec14fc1351114b")

The result is CORRECT!

<B>QUESTION #7</B>: Find the 6th lowest unique salary in the company. The answer should only be a number.

<B>SOLUTION</B>:

In [35]:
# The answer is a one-liner!
unique_salary = employees.drop_duplicates(subset=['Salary'])

sorted_salary = unique_salary.sort_values(by='Salary', ascending=True)

sixth_lowest_unique_salary = sorted_salary.iloc[5]['Salary']
sixth_lowest_unique_salary

90000

In [36]:
# Do not change the following line!
check(7, sixth_lowest_unique_salary, "6415533d0b3209198c1d6f533b61a4da")

The result is CORRECT!

<B>QUESTION #8</B>: Find who in the company gets paid the 6th lowest unique salary. 
                    Your answer should be a single string with the "Name" and 
                    "Last Name" of the employee in it.

<B>SOLUTION</B>: Using the "sixth_lowest_unique_salary" we found in the previous question:

In [37]:
unique_salaries = employees_df['Salary'].unique()
unique_salaries.sort()

employee_with_the_sixth_lowest_unique_salary = unique_salaries[5]
employees = employees_df[employees_df['Salary'] == employee_with_the_sixth_lowest_unique_salary].iloc[0]

name = employees['Name']
last_name = employees['Last Name']

name_and_lastname_of_employee = f'{name} {last_name}'
name_and_lastname_of_employee

'KIM KRATER'

In [38]:
# Do not change the following line!
check(8, name_and_lastname_of_employee, "57444e392eea58d5b205a0632ca495e6")

The result is CORRECT!

<B>QUESTION #9</B>: Find the most common hiring date in the company 
                    and return all employees that were hired on that date.
                    Your answer should be a data frame with three columns:
                    "Name", "Last Name", "Hiring Date" and should be sorted 
                    by "Name" and "Last Name" in descending order.

<B>SOLUTION</B>:

In [39]:
most_common_date = employees_df['Hiring Date'].mode()[0]

employees_on_common_date = employees_df[employees_df['Hiring Date'] == most_common_date]

employees_on_common_date = employees_on_common_date.sort_values(['Name', 'Last Name'], ascending=[False, False])

result_df = pd.DataFrame({
    'Name': employees_on_common_date['Name'],
    'Last Name': employees_on_common_date['Last Name'],
    'Hiring Date': employees_on_common_date['Hiring Date']
})
result_df

     Name Last Name Hiring Date
3   DIANA       DEW  2000-01-05
2   CAROL     CRAFT  2000-01-05
1    BILL    BABBLE  2000-01-05
0  ALBERT     ADAMS  2000-01-05

In [40]:
# Do not change the following line!
check(9, result_df, "74becb4e5d86e71f978d8f93fb24a2de")

The result is CORRECT!

<B>QUESTION #10</B>: Find the number of employees hired in the first year

<B>SOLUTION</B>:

In [41]:
employees_df['Year Hired'] = pd.to_datetime(employees_df['Hiring Date']).dt.year

number_of_employees_hired_in_first_year = len(employees_df[employees_df['Year Hired'] == employees_df['Year Hired'].min()])
number_of_employees_hired_in_first_year

4

In [42]:
# Do not change the following line!
check(10, number_of_employees_hired_in_first_year, "48a24b70a0b376535542b996af517398")

The result is CORRECT!

<B>QUESTION #11</B>: Find the most common job title in the company

<B>SOLUTION</B>:

In [43]:
job_title_counts = employees_df['Title'].mode()[0]  # complete this line
most_common_job_title = job_title_counts # complete this line
most_common_job_title

'ENGINEER'

In [44]:
# Do not change the following line!
check(11, most_common_job_title, "363e0571a300bf98aec2757d6b889d7c")

The result is CORRECT!

<B>QUESTION #12</B>: Find the number of employees in the department with the highest headcount

<B>SOLUTION</B>:

In [99]:
max_headcount = employees['Department'].value_counts()
max_headcount = max_headcount[0]
max_headcount

8

In [100]:
# Do not change the following line!
check(12, max_headcount, "c30f7472766d25af1dc80b3ffc9a58c7")

The result is CORRECT!

<B>QUESTION #13</B>: Find the department with the highest headcount

<B>SOLUTION</B>:

In [101]:
department_employee_counts = employees['Department'].value_counts()  # complete this line
department_with_highest_headcount = department_employee_counts .index[0]  # complete this line
department_with_highest_headcount

'ENGINEERING'

In [102]:
# Do not change the following line!
check(13, department_with_highest_headcount, "fb6e273ac24d8949a4e16d85218db754")

The result is CORRECT!

<B>QUESTION #14</B>: Find the payroll budget (i.e. total salaries) for each department and sort them in ascending order. Provide the answer with departments as indices and "Salary" column column renamed as "Budget".

<B>SOLUTION</B>:

In [195]:
department_budgets_list_sorted = employees.groupby('Department')[['Salary']].sum() # complete this line
department_budgets_list_sorted = department_budgets_list_sorted.sort_values('Salary')
department_budgets_list_sorted = department_budgets_list_sorted.rename(columns={'Salary': 'Budget'})
department_budgets_list_sorted

                  Budget
Department
ADMIN              40000
IT                173000
SALES             200000
FINANCE           260000
MARKETING         300000
HUMAN RESOURCES   560000
ENGINEERING      1200000
EXECUTIVE TEAM   2500000

In [171]:
# Do not change the following line!
check(14, department_budgets_list_sorted, "47144800ba49dac765fd5f3f2ca53980")

The result is CORRECT!

<B>QUESTION #15</B>: Find how many direct reports each manager has, 
                     report them by manager's first name and last name,
                     also sorting them by the number of reports
                     and the name of the manager (both in descending order).
                     Your final answer should have the "Name", "Last Name", 
                     "Number of Reports" columns in that order.

<B>SOLUTION</B>:

In [231]:
number_of_reports_by_manager_ID = employees.merge( employees, left_on = 'Employee ID', right_on = 'Manager ID').groupby(['Name_y','Last Name_y']).size().reset_index(name = 'Number of Reports')
number_of_reports_by_manager_name = number_of_reports_by_manager_name.rename(columns = {'Name_y' : 'Name', 'Last Name_y' : 'Last Name'})
number_of_reports_by_manager_name_sorted = number_of_reports_by_manager_name.sort_values(by=['Number of Reports', 'Name', 'Last Name'], ascending=[False, False, False])
number_of_reports_by_manager_name_sorted

     Name Last Name  Number of Reports
0  ALBERT     ADAMS                 10
3   HENRY    HOOVER                  4
9     XIN     XIANG                  2
8     UMA    ULLMAN                  2
6  QUINCY     QUINN                  2
7    RYAN   REDFORD                  1
5   OSCAR    OSWALD                  1
4   NANCY    NEWARK                  1
2    GARY  GARFIELD                  1
1  EDWARD      EVES                  1

In [232]:
# Do not change the following line!
check(15, number_of_reports_by_manager_name_sorted, "e35539d8cfaa3380cb515772be15f6d1")

The result is CORRECT!

<B>QUESTION #16</B>: Find the manager with lowest payroll budget 
                     (i.e. sum of the salaries of direct reports). 
                     Your answer should only include the "Name" and 
                     the "Last Name" of that manager as a single string.

<B>SOLUTION</B>:

In [238]:
manager_id_with_lowest_budget = employees.groupby('Manager ID')['Salary'].sum().idxmin()  # complete this line
manager_with_lowest_budget = employees[employees['Employee ID'] == manager_id_with_lowest_budget].iloc[0]  # complete this line
full_name_of_manager_with_lowest_budget = f'{manager_with_lowest_budget[1]} {manager_with_lowest_budget[2]}'  # complete this line
full_name_of_manager_with_lowest_budget

'OSCAR OSWALD'

In [239]:
# Do not change the following line!
check(16, full_name_of_manager_with_lowest_budget, "9ea14904aad646e15432fd6ebb3f9c17")

The result is CORRECT!

<B>QUESTION #17</B>: Find the list of employees who get paid under $90K along 
                     with their managers, and sort them 
                     by their salaries (in descending order) 
                     and "Employee Name" (in ascending order). 
                     Your answer should be a data frame with the
                     "Employee Name", "Employee Last Name", "Manager Name", 
                     "Manager Last Name", "Employee Salary" columns in that order.

<B>SOLUTION</B>:

In [375]:
employees_with_low_salaries = employees[employees['Salary'] < 90000]
employees_with_low_salaries_merge = employees_with_low_salaries.merge(employees, left_on = 'Manager ID', right_on = 'Employee ID')
employees_with_low_salaries.rename(columns={'Name_x':'Employee Name','Last Name_x': 'Employee Last Name','Name_y':'Manager Name','Last Name_y':'Manager Last Name','Salary_x':'Employee Salary'})
employees_with_low_salaries_sorted[['Employee Name', 'Employee Last Name', 'Manager Name', 'Manager Last Name', 'Employee Salary']]
employees_with_low_salaries_sorted.sort_values(by=['Employee Salary','Employee Name'], ascending = [False, True])
# I DON'T HAVE IDEA WHERE'S THE ISSUE

,Employee Name,Employee Last Name,Manager Name,Manager Last Name,Employee Salary
0,JEREMY,JACKSON,HENRY,HOOVER,80000
3,OSCAR,OSWALD,NANCY,NEWARK,80000
6,SALLY,SMITH,QUINCY,QUINN,80000
2,XIN,XIANG,ALBERT,ADAMS,80000
4,PENNY,PEABODY,OSCAR,OSWALD,60000
5,RYAN,REDFORD,QUINCY,QUINN,60000
7,YANNY,YOUNG,XIN,XIANG,50000
8,ZACK,ZIMMERMAN,XIN,XIANG,43000
1,MAY,MOORE,ALBERT,ADAMS,40000

In [374]:
# Do not change the following line!
check(17, employees_with_low_salaries_sorted, "d5e22a820111aed586b3f02f6ad7fe24")

ERROR: The result is NOT correct!

AssertionError:

<B>QUESTION #18</B>: Find the 5th most recently hired employee of the company.
                     Your answer should be a data frame with 
                     "Name", "Last Name" and "Hiring Date" columns in that order.

<B>SOLUTION</B>:

In [378]:
# The answer is a one-liner!
fifth_most_recent_hire = employees.sort_values('Hiring Date', ascending=False).iloc[[4]][['Name', 'Last Name', 'Hiring Date']]
fifth_most_recent_hire

   Name Last Name Hiring Date
20  UMA    ULLMAN  2002-11-07

In [379]:
# Do not change the following line!
check(18, fifth_most_recent_hire, "fc7f1557fbdaea587879ec1c67499f91")

The result is CORRECT!

<B>QUESTION #19</B>: Find the employee(s) with the lowest salary from each department.
                     Your answer should be a data frame with four columns:
                     "Department", "Name", "Last Name", "Salary".
                     The result should be sorted by "Salary", "Department" and "Name" in 
                     descending, ascending and ascending order respectively.

<B>SOLUTION</B>:

In [395]:
department_lowest_salaries = employees.groupby('Department').apply(lambda x: x.loc[x['Salary'] == x['Salary'].min()])  # complete this line
department_lowest_salary_employees_sorted = department_lowest_salaries[['Department', 'Name', 'Last Name', 'Salary']].reset_index(drop=True)  # complete this line
department_lowest_salary_employees_sorted = department_lowest_salary_employees_sorted.sort_values(['Salary', 'Department', 'Name'], ascending=[False, True, True])
department_lowest_salary_employees_sorted
# I think the index isn't right, but I did the task properly

        Department    Name  Last Name  Salary
2   EXECUTIVE TEAM    BILL     BABBLE  500000
3   EXECUTIVE TEAM   CAROL      CRAFT  500000
4   EXECUTIVE TEAM   DIANA        DEW  500000
9            SALES   LAURA        LEE  200000
8        MARKETING   VICKY    VINCENT  120000
1      ENGINEERING  JEREMY    JACKSON   80000
5          FINANCE   PENNY    PEABODY   60000
6  HUMAN RESOURCES    RYAN    REDFORD   60000
7               IT    ZACK  ZIMMERMAN   43000
0            ADMIN     MAY      MOORE   40000

In [381]:
# Do not change the following line!
check(19, department_lowest_salary_employees_sorted, "c44f7791d81cf34f8b860e8070b0805a")

ERROR: The result is NOT correct!

AssertionError:

<B>QUESTION #20</B>: Find the list of employees with salaries below \\$150K whose
                     manager's budget is under \\$200K.
                     Your answer should be a data frame with six columns:
                     "Employee Name", "Employee Last Name", "Employee Salary",
                     "Manager Name", "Manager Last Name", "Manager Budget" 
                     (in that order) and should be sorted by "Employee Salary" 
                     and "Manager Budget" in ascending order.

<B>SOLUTION</B>:

In [450]:
employees_with_low_salaries = employees[employees['Salary'] < 150000]
manager_budgets = employees.groupby('Manager ID').Salary.sum().reset_index(name='Manager Budget')
managers_with_high_budget = manager_budgets[manager_budgets['Manager Budget'] < 200000]
managers_with_high_budget = employees_with_low_salaries.merge(managers_with_high_budget, on='Manager ID').merge(employees_with_low_salaries, right_on='Employee ID', left_on='Manager ID'),[[ 'Employee Name', 'Employee Last Name', 'Employee Salary', 'Manager Name', 'Manager Last Name', 'Manager Budget']]
employees_with_low_salaries_sorted.sort_values(by=['Employee Salary', 'Manager Budget'])
employees_with_low_salaries_sorted

,Employee Name,Employee Last Name,Employee Salary,Manager Name,Manager Last Name,Manager Budget
6,ZACK,ZIMMERMAN,43000,XIN,XIANG,93000
5,YANNY,YOUNG,50000,XIN,XIANG,93000
1,PENNY,PEABODY,60000,OSCAR,OSWALD,60000
3,RYAN,REDFORD,60000,QUINCY,QUINN,140000
0,OSCAR,OSWALD,80000,NANCY,NEWARK,80000
4,SALLY,SMITH,80000,QUINCY,QUINN,140000
2,QUINCY,QUINN,120000,RYAN,REDFORD,120000

In [451]:
# Do not change the following line!
check(20, employees_with_low_salaries_sorted, "3418fd0a8b0def15091b9cdec3016de7")

The result is CORRECT!